app/controllers/mod/admins_controller.rb

	def update
		@admin = Admin.find(params[:id])

		if @admin.update(admin_params)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "admins" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["username", "ekicenx@gmail.com"], ["password_digest", "$2a$10$r7P2sLUrV7XeS/5dar7UGuFfF6mtg1dHMOScEnZS5YwMd7.uuElCq"], ["updated_at", "2016-03-26 13:08:57.044205"], ["id", 1]]