app/controllers/mod/mobils_controller.rb

SELECT  "mobils".* FROM "mobils" WHERE (nama LIKE '%LLC%' OR merk LIKE '%LLC%') LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "mobils" WHERE (nama LIKE '%LLC%' OR merk LIKE '%LLC%')
---
  def index
    if params[:search].present?
      @mobils = Mobil.matching(params[:search]).page params[:page]

INSERT INTO "mobils" ("nama", "merk", "warna", "harga", "keterangan", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nama", "Sedan"], ["merk", "Honda"], ["warna", "Hitam"], ["harga", 200000.0], ["keterangan", "t"], ["created_at", "2016-03-30 14:13:24.471289"], ["updated_at", "2016-03-30 14:13:24.471289"]]
---
  def create
    @mobil = Mobil.new(mobil_params)

    if @mobil.save

SELECT  "mobils".* FROM "mobils" WHERE "mobils"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @mobil = Mobil.find(params[:id])

SELECT  "mobils".* FROM "mobils" WHERE "mobils"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "mobils" SET "keterangan" = ?, "updated_at" = ? WHERE "mobils"."id" = ?  [["keterangan", "f"], ["updated_at", "2016-03-30 06:46:14.142777"], ["id", 1]]
---
  def update
    @mobil = Mobil.find(params[:id])
    if @mobil.update(mobil_params)

SELECT  "mobils".* FROM "mobils" WHERE "mobils"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @mobil = Mobil.find(params[:id])

SELECT  "mobils".* FROM "mobils" WHERE "mobils"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "mobils" WHERE "mobils"."id" = ?  [["id", 1]]
---
  def destroy
    @mobil = Mobil.find(params[:id])
    @mobil.destroy