app/controllers/mod/pelanggans_controller.rb

  def index
    if params[:search].present?
      @pelanggans = Pelanggan.matching(params[:search]).page params[:page]
---
SELECT  "pelanggans".* FROM "pelanggans" WHERE (nama LIKE '%cikajang%' OR alamat LIKE '%cikajang%') LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "pelanggans" WHERE (nama LIKE '%cikajang%' OR alamat LIKE '%cikajang%')

  def create
    @pelanggan = Pelanggan.new(pelanggan_params)

    if @pelanggan.save
---
INSERT INTO "pelanggans" ("nama", "alamat", "jenis_kelamin", "no_telp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nama", "Agus"], ["alamat", "Tarogong"], ["jenis_kelamin", "f"], ["no_telp", 87], ["created_at", "2016-04-01 08:38:00.147882"], ["updated_at", "2016-04-01 08:38:00.147882"]]

  def show
    @pelanggan = Pelanggan.find(params[:id])
---
SELECT  "pelanggans".* FROM "pelanggans" WHERE "pelanggans"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @pelanggan = Pelanggan.find(params[:id])
---
SELECT  "pelanggans".* FROM "pelanggans" WHERE "pelanggans"."id" = ? LIMIT 1  [["id", 30]]

  def update
    @pelanggan = Pelanggan.find(params[:id])
    if @pelanggan.update(pelanggan_params)
---
SELECT  "pelanggans".* FROM "pelanggans" WHERE "pelanggans"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pelanggans" SET "jenis_kelamin" = ?, "updated_at" = ? WHERE "pelanggans"."id" = ?  [["jenis_kelamin", "Perempuan"], ["updated_at", "2016-04-01 09:12:57.642158"], ["id", 1]]

  def destroy
    @pelanggan = Pelanggan.find(params[:id])
    @pelanggan.destroy
---
SELECT  "pelanggans".* FROM "pelanggans" WHERE "pelanggans"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "pelanggans" WHERE "pelanggans"."id" = ?  [["id", 2]]