app/controllers/mod/sessions_controller.rb

  def create
  	@admin = Admin.find_by(username: params[:username]).try(:authenticate, params[:password])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT 1  [["username", "ekicenx@gmail.com"]]