app/controllers/mod/transaksis_controller.rb

SELECT  "transaksis".* FROM "transaksis"  ORDER BY "transaksis"."id" ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "transaksis"
---
  def index
    if params[:search].present?
      @transaksis = Transaksi.matching(params[:search]).page params[:page]

INSERT INTO "transaksis" ("id", "mobil_id", "pelanggan_id", "lama_sewa", "total_bayar", "uang_muka", "sisa_bayar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @transaksi = Transaksi.new(transaksi_params)

    if @transaksi.save